<%langTran("common");%>
<%langTran("DnsFilter");%>

var cityArray = new Array();
cityArray[0] = new Array("上海","+8613010314500","上海,+8613800210500");
cityArray[1] = new Array("北京","+8613010112500","北京,+8613800100500");
cityArray[2] = new Array("天津","+8613010130500","天津,+8613800220500");
cityArray[3] = new Array("重庆","+8613010831500","重庆,+8613800230500");
cityArray[4] = new Array("安徽","+8613010305500","合肥,+8613800551500|蚌埠,+8613800551500|芜湖,+8613800553500|淮南,+8613800558500|马鞍山,+8613800553500|淮北,+8613800558500|铜陵,+8613800553500|安庆,+8613800551500|黄山,+8613800553500|阜阳,+8613800558500|宿州,+8613800558500|滁州,+8613800551500|六安,+8613800551500|宣城,+8613800553500|巢湖,+8613800551500|池州,+8613800551500|亳州,+8613800558500");
cityArray[5] = new Array("福建","+8613010380500","福州,+8613800591500|厦门,+8613800592500|莆田,+8613800594500|三明,+8613800598500|泉州,+8613800595500|漳州, +8613800596500|南平, +8613800599500|龙岩, +8613800597500|宁德,+8613800593500");
cityArray[6] = new Array("甘肃","+8613010879500","兰州,+8613800931500|嘉峪关,+8613800931500|金昌,+8613800931500|白银,+8613800931500|天水,+8613800931500|酒泉,+8613800931500|张掖,+8613800931500|武威,+8613800931500|定西,+8613800931500|陇南,+8613800931500|平凉,+8613800931500|庆阳,+8613800931500|临夏,+8613800931500|甘南,+8613800931500");
cityArray[7] = new Array("广东","+8613010200500|+8613010888500","广州,+8613800200500|深圳,+8613800755500|珠海,+8613800756500|汕头,+8613800754500|韶关,+8613800751500|佛山,+8613800757500|江门,+8613800750500|湛江,+8613800759500|茂名,+8613800668500|肇庆,+8613800758500|惠州,+8613800752500|梅州,+8613800753500|汕尾,+8613800660500|河源,+8613800762500|阳江,+8613800662500|清远,+8613800763500|东莞,+8613800769500|中山,+8613800760500|潮州,+8613800768500|揭阳,+8613800663500|云浮,+8613800766500");
cityArray[8] = new Array("广西","+8613010591500","南宁,+8613800771500|柳州,+8613800772500|桂林,+8613800773500|梧州,+8613800774500|北海,+8613800779500|防城港,+8613800770500|钦州,+8613800777500|玉林,+8613800775500|百色, +8613800776500|河池,+8613800778500");
cityArray[9] = new Array("贵州","+8613010788500","贵阳,+8613800851500|六盘水,+8613800851500|遵义,+8613800851500|安顺,+8613800851500|铜仁,+8613800851500|毕节地区,+8613800851500|黔西南,+8613800851500|黔东南,+8613800851500|黔南,+8613800851500");
cityArray[10] = new Array("海南","+8613010501500","海口,+8613800898500|三亚,+8613800898500|文昌,+8613800898500|琼海,+8613800898500|万宁,+8613800898500|五指山,+8613800898500|东方,+8613800898500|儋州,+8613800898500|临高,+8613800898500|澄迈,+8613800898500|定安,+8613800898500|屯昌,+8613800898500|昌江,+8613800898500|白沙,+8613800898500|琼中,+8613800898500|陵水,+8613800898500|保亭,+8613800898500|乐东,+8613800898500");
cityArray[11] = new Array("河北","+8613010180500","石家庄,+8613800311500|唐山,+8613800311500|秦皇岛,+8613800311500|邯郸,+8613800311500|邢台,+8613800311500|保定,+8613800311500|张家口,+8613800311500|承德,+8613800311500|沧州,+8613800311500|廊坊,+8613800311500|衡水,+8613800311500");
cityArray[12] = new Array("河南","+8613010761500","郑州,+8613800371500|开封,+8613800378500|洛阳,+8613800379500|平顶山,+8613800375500|焦作,+8613800391500|鹤壁,+8613800392500|新乡,+8613800373500|安阳,+8613800372500|濮阳,+8613800393500|许昌,+8613800374500|漯河,+8613800395500|三门峡,+8613800398500|南阳,+8613800377500|商丘,+8613800370500|信阳, +8613800376500|周口,+8613800394500|驻马店, +8613800396500");
cityArray[13] = new Array("黑龙江","+8613010980500","哈尔滨,+8613800451500|齐齐哈尔,+8613800452500|鸡西,+8613800453500|鹤岗,+8613800454500|双鸭山,+8613800454500|大庆,+8613800459500|伊春,+8613800455500|佳木斯,+8613800454500|七台河,+8613800453500|牡丹江,+8613800453500|黑河,+8613800456500|绥化,+8613800455500|大兴安岭,+8613800456500");
cityArray[14] = new Array("湖北","+8613010710500","武汉,+8613800270500|黄石,+8613800714500|襄樊,+8613800710500|十堰,+8613800719500|荆州,+8613800716500|宜昌, +8613800717500|荆门|鄂州,+8613800711500|孝感,+8613800712500|黄冈,+8613800713500|咸宁,+8613800715500|随州,+8613800722500|恩施,+8613800718500");
cityArray[15] = new Array("湖南","+8613010731500","长沙,+8613800731500|株洲,+8613800733500|湘潭,+8613800732500|衡阳,+8613800734500|邵阳,+8613800739500|岳阳,+8613800730500|常德,+8613800736500|张家界, +8613800744500|益阳,+8613800737500|郴州,+8613800735500|永州, +8613800746500|怀化, +8613800745500|娄底,+8613800738500");
cityArray[16] = new Array("吉林","+8613010911500","长春,+8613800431500|吉林,+8613800432500|四平,+8613800434500|辽源,+8613800438500|通化,+8613800435500|白山,+8613800439500|松原, +8613800438500|白城, +8613800436500|延吉,+8613800433500");
cityArray[17] = new Array("江苏","+8613010341500","南京,+8613800250500|无锡,+8613800510500|徐州,+8613800516500|常州,+8613800519500|苏州,+8613800512500|南通,+8613800513500|连云港,+8613800518500|淮安,+8613800517500|盐城,+8613800515500|扬州,+8613800514500|镇江,+8613800511500|泰州,+8613800523500|宿迁,+8613800527500");
cityArray[18] = new Array("江西","+8613010720500","南昌,+8613800791500|景德镇,+8613800791500|萍乡,+8613800791500|九江,+8613800791500|新余,+8613800791500|鹰潭,+8613800791500|赣州,+8613800791500|吉安,+8613800791500|宜春,+8613800791500|抚州,+8613800791500|上饶,+8613800791500");
cityArray[19] = new Array("辽宁","+8613010240500","沈阳,+8613800240500|大连,+8613800240500|鞍山,+8613800240500|抚顺,+8613800240500|本溪,+8613800240500|丹东,+8613800240500|锦州,+8613800240500|营口,+8613800240500|阜新,+8613800240500|辽阳,+8613800240500|盘锦,+8613800240500|铁岭,+8613800240500|朝阳,+8613800240500|葫芦岛,+8613800240500");
cityArray[20] = new Array("内蒙古","+8613010950500","呼和浩特,+8613800471500|包头,+8613800471500|乌海,+8613800471500|赤峰,+8613800471500|通辽,+8613800471500|鄂尔多斯,+8613800471500|呼伦贝尔,+8613800471500|巴彦淖尔,+8613800471500|乌兰察布,+8613800471500|兴安盟,+8613800471500|锡林,+8613800471500|阿拉善,+8613800471500");
cityArray[21] = new Array("宁夏","+8613010796500","银川,+8613800951500|石嘴山,+8613800951500|吴忠,+8613800951500|固原,+8613800951500|中卫,+8613800951500");
cityArray[22] = new Array("青海","+8613010776500","西宁,+8613010776500|海东地区,#|海北,#|黄南,#|海南,#|果洛,#|玉树,#|海西,#");
cityArray[23] = new Array("山东","+8613010171500","济南,+8613800531500|青岛,+8613800532500|淄博,+8613800533500|枣庄|东营,+8613800546500|烟台,+8613800535500|潍坊,+8613800536500|威海,+8613800631500|济宁,+8613800537500|泰安,+8613800538500|日照|莱芜,+8613800634500|临沂,+8613800539500|德州, +8613800534500|聊城,+8613800635500|滨州|菏泽");
cityArray[24] = new Array("山西","+8613010701500","太原,+8613800791500|大同,+8613800791500|阳泉,+8613800791500|长治,+8613800791500|晋城,+8613800791500|朔州,+8613800791500|晋中,+8613800791500|运城,+8613800791500|忻州,+8613800791500|临汾,+8613800791500|吕梁,+8613800791500");
cityArray[25] = new Array("陕西","+8613010851500","西安,+8613800290500|铜川,+8613800290500|宝鸡,+8613800290500|咸阳,+8613800290500|渭南,+8613800290500|延安,+8613800290500|汉中,+8613800290500|榆林,+8613800290500|安康,+8613800290500|商洛,+8613800290500");
cityArray[26] = new Array("四川","+8613010811500","成都,+8613800280500|绵阳,+8613800280500|自贡,+8613800280500|攀枝花,+8613800280500|泸州,+8613800280500|德阳,+8613800280500|广元,+8613800280500|遂宁,+8613800280500|内江,+8613800280500|乐山,+8613800280500|南充,+8613800280500|宜宾,+8613800280500|广安,+8613800280500|达州,+8613800280500|眉山,+8613800280500|雅安,+8613800280500|巴中,+8613800280500|资阳,+8613800280500|阿坝,+8613800280500|甘孜,+8613800280500|凉山,+8613800280500");
//cityArray[27] = new Array("西藏","#","拉萨,#|山南,#|日喀则,#|那曲,#|阿里,#|林芝,#");
cityArray[27] = new Array("新疆","+8613010969500","乌鲁木齐,+8613800471500|克拉玛依,+8613800471500|吐鲁番,+8613800471500|哈密,+8613800471500|昌吉,+8613800471500|和田,+8613800471500|阿克苏,+8613800471500|喀什,+8613800471500|克孜勒苏柯尔克孜,+8613800471500|巴音郭楞,+8613800471500|博尔塔拉,+8613800471500|伊犁,+8613800471500|塔城,+8613800471500|阿勒泰,+8613800471500|石河子,+8613800471500|阿拉尔,+8613800471500|图木舒克,+8613800471500|五家渠,+8613800471500");
cityArray[28] = new Array("云南","+8613010868500","昆明,+8613800871500|曲靖,+8613800871500|玉溪,+8613800871500|保山,+8613800871500|昭通,+8613800871500|丽江,+8613800871500|普洱,+8613800871500|临沧,+8613800871500|文山壮族,+8613800871500|红河,+8613800871500|西双版纳,+8613800871500|楚雄,+8613800871500|大理,+8613800871500|德宏,+8613800871500|怒江,+8613800871500|迪庆藏族,+8613800871500");
cityArray[29] = new Array("浙江","+8613010360500","杭州,+8613800571500|宁波,+8613800574500|温州,+8613800577500|嘉兴,+8613800573500|湖州,+8613800572500|绍兴,+8613800575500|金华,+8613800579500|衢州,+8613800570500|舟山,+8613800580500|台州, +8613800576500|丽水, +8613800578500");
cityArray[30] = new Array("香港","#","香港,+85290288000");
cityArray[31] = new Array("澳门","#","澳门,+8536800853");
cityArray[32] = new Array("台湾","#","台湾,#");

/***********************sms send***********************************/
function read() {
    
    var tbl=WebAuthGlobal;
    tbl.province.options.length = 1;
 
    for (i = 0; i < cityArray.length; i++)
     { 
	var option1=document.createElement("OPTION");
	option1.text=cityArray[i][0];
	tbl.province.options.add(option1);
    
      }
}

function getCity() {

    var tbl=WebAuthGlobal;
    tbl.city.options.length = 1;
    
    var t =document.getElementById("province");
    var currProvince =t.options[t.selectedIndex].text;

    if (currProvince == "") {
        tbl.city.options.length = 1;
    }
    else {
        var i, j;
        for (i = 0; i < cityArray.length; i++) {
            if (cityArray[i][0] == currProvince) {
		
                tmpcityArray = cityArray[i][2].split("|")
                for (j = 0; j < tmpcityArray.length; j++) {
		    tmp=tmpcityArray[j].split(",");
		    var option1=document.createElement("OPTION");
		    option1.text=tmp[0];
		    tbl.city.options.add(option1);
                }
            }
        }
    }
    
}
function getNumber() {

    var tbl=WebAuthGlobal;
    var regPartton=/^\+8613[0|8]+\d{6}00$/;
    var pos_city = document.getElementById("city");
    var pos_prov=document.getElementById("province");
    var number = document.getElementById("sms_number");
    var i = pos_prov.selectedIndex, j=pos_city.selectedIndex;
    
    if (cityArray[i-1][0] == "") {
        alert("请重新选择！");
	return ;
    }
    if(i<=0 || j<=0){
	alert("请重新选择！");
	return ;
    }
    if(tbl.cdmaType[0].checked){
	number.value = "#";
    }else if(tbl.cdmaType[1].checked){
	tmp = cityArray[i-1][1];
	number.value = tmp;
	if(7 == i-1){
	    tmp = cityArray[i-1][1].split("|");
	    number.value = tmp[0];
	    if( 1 == j-1){
		tmp = cityArray[i-1][1].split("|");
	        number.value = tmp[1];
	    }
	}
    }else{  
	tmpcityArray = cityArray[i-1][2].split("|");
	tmp=tmpcityArray[j-1].split(",");
	number.value = tmp[1];
    }
    if(!regPartton.test(number.value)){
     alert("无该地短信中心号码，请确认手机号码归属地！");
    }
}

function setSMS(){
    var tbl = WebAuthGlobal;
    
    if(cdmaType == "CDMA2000") {
	tbl.cdmaType[0].checked = true;
    } else if(cdmaType == "WCDMA"){
	tbl.cdmaType[1].checked = true;
    }else{
	tbl.cdmaType[2].checked = true;
    }
    var i = 0 ; j =0;
     for (i = 0; i < cityArray.length; i++)
     { 
	if(cityArray[i][0] == province){
	    tbl.province.options.selectedIndex =  i+1;
	    break;
	}
      }
      if(i >= cityArray.length)
	return;
      getCity();
     tmpcityArray = cityArray[i][2].split("|")
     for (j = 0; j < tmpcityArray.length; j++) {
        tmp=tmpcityArray[j].split(",");
	if(tmp[0] != city){
	    continue;
	}
	tbl.city.options.selectedIndex =  j+1;
	tbl.sms_number.value=  sms_number;

     }
     
}
function cdmaChange()
{   
    var pos_city = document.getElementById("city");
    var pos_prov=document.getElementById("province");
    
    pos_prov.selectedIndex = 0;
    pos_city.selectedIndex = 0;
}
